<?php

/*******************************************************************************

 設定ファイル

*******************************************************************************/

/* 公開URL */
$GLOBALS['config']['http_url'] = '';

/* 設置ディレクトリ */
$GLOBALS['config']['http_path'] = dirname($_SERVER['SCRIPT_NAME']) . '/';

/* オプション項目 */
$GLOBALS['config']['options'] = array(
    'inquries' => array(
        // 都道府県
        'prefectures' => array(
             1 => '北海道',
             2 => '青森県',
             3 => '岩手県',
             4 => '宮城県',
             5 => '秋田県',
             6 => '山形県',
             7 => '福島県',
             8 => '茨城県',
             9 => '栃木県',
            10 => '群馬県',
            11 => '埼玉県',
            12 => '千葉県',
            13 => '東京都',
            14 => '神奈川県',
            15 => '新潟県',
            16 => '富山県',
            17 => '石川県',
            18 => '福井県',
            19 => '山梨県',
            20 => '長野県',
            21 => '岐阜県',
            22 => '静岡県',
            23 => '愛知県',
            24 => '三重県',
            25 => '滋賀県',
            26 => '京都府',
            27 => '大阪府',
            28 => '兵庫県',
            29 => '奈良県',
            30 => '和歌山県',
            31 => '鳥取県',
            32 => '島根県',
            33 => '岡山県',
            34 => '広島県',
            35 => '山口県',
            36 => '徳島県',
            37 => '香川県',
            38 => '愛媛県',
            39 => '高知県',
            40 => '福岡県',
            41 => '佐賀県',
            42 => '長崎県',
            43 => '熊本県',
            44 => '大分県',
            45 => '宮崎県',
            46 => '鹿児島県',
            47 => '沖縄県',
        ),
        // 性別
        'genders' => array(
            'none'   => '無回答',
            'male'   => '男性',
            'female' => '女性',
        ),
        // 興味をお持ちの分野
        'interests' => array(
            'cording' => 'HTMLコーディング',
            'program' => 'プログラム',
            'server'  => 'サーバ',
        ),
        // 返信
        'replies' => array(
            0 => '不要',
            1 => '必要',
        ),
    ),
);

/* メールの送信先 */
$GLOBALS['config']['mail_to'] = 'example@example.com';

/* メールの件名 */
$GLOBALS['config']['mail_subject'] = 'お問い合わせ';

/* メールの署名 */
$GLOBALS['config']['mail_signature'] = '
- - - - - - - - - - - - - - - - - - - -
levis-demo: demo@example.com
- - - - - - - - - - - - - - - - - - - -
';

/* メールのヘッダ */
$GLOBALS['config']['mail_headers'] = array(
    'X-Mailer' => 'levis-inquiry',
    'From'     => '"From" <auto@example.com>',
);

/* メールの送信 */
$GLOBALS['config']['mail_send'] = true;

/* メールの記録 */
$GLOBALS['config']['mail_log'] = false;
